app/controllers/blogs_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "blogs" ("city_id", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["city_id", 6], ["user_id", 10], ["description", "I love SF"], ["created_at", "2018-04-24 22:59:17.754811"], ["updated_at", "2018-04-24 22:59:17.754811"]]
---
  def create
    post_params = params.require(:blog).permit(:city_id,:description)
    @user = current_user.id
    @blog = City.find_by_id(params[:city_id])
            .blogs
            .new(post_params)
    @blog.user_id = @user
    @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @blog = Blog.find_by_id(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def new
    @blog = Blog.new
    @city = City.find_by_id(params[:city_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by_id(params[:user_id])
    @blog = Blog.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "blogs" SET "description" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["description", "I love SF.  So much to do"], ["updated_at", "2018-04-24 22:59:35.069955"], ["id", 8]]
---
  def update
    update_params = params.require(:blog).permit(:description)
    @user = User.find_by_id(params[:user_id]).id
    @blog = Blog.find_by_id(params[:id])
    @blog.update_attributes(update_params)