app/controllers/cities_controller.rb

  def show
    @city=City.find_by_id(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]