app/controllers/users_controller.rb

	def show
		@user = User.find_by_id(params[:id])
		cookies[:user_id]=@user.id
		@blogs = Blog.where(["user_id = ?",@user.id]).select("*")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT * FROM "blogs" WHERE (user_id = 10)

	def create
		@user = User.create(user_params)
---
INSERT INTO "users" ("name", "address", "password_digest", "email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"